Revit 2024 API
FailuresAccessor.CanCommitPendingTransaction Method
 Checks if pending failure processing can be finished by committing a pending transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool CanCommitPendingTransaction()
Visual Basic
Public Function CanCommitPendingTransaction As Boolean
Visual C++
public:
bool CanCommitPendingTransaction()
Return Value
 True if there is a pending transaction and this transaction is allowed to be committed.
Remarks
 Check makes sense only if the failure processing is pending.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace